Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cmd.c
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 * Copyright (c) 2010, 2011, Oracle and/or its affiliates. All rights reserved.
 */

/*
 * mcxnex_cmd.c
 *    Firmware Command Routines
 *
 *    Implements all the routines necessary for allocating, posting,
 *    and freeing commands for the firmware.  These routines manage a
 *    preallocated list of command mailboxes and provide interfaces to
 *    post each of the several dozen commands to the firmware.
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>
#include <sys/modctl.h>
#include <sys/bitmap.h>

#include "mcxnex.h"

static int mcxnex_impl_mbox_alloc(mcxnex_state_t *,
    mcxnex_mboxlist_t *, mcxnex_mbox_t **, uint_t mbox_wait);
static void mcxnex_impl_mbox_free(mcxnex_mboxlist_t *, mcxnex_mbox_t **);
static int mcxnex_impl_mboxlist_init(mcxnex_state_t *,
    mcxnex_mboxlist_t *, uint_t num_mbox, mcxnex_rsrc_type_t);
static void mcxnex_impl_mboxlist_fini(mcxnex_state_t *, mcxnex_mboxlist_t *);
static int mcxnex_outstanding_cmd_alloc(mcxnex_state_t *state,
    mcxnex_cmd_t **cmd_ptr, uint_t cmd_wait);
static void mcxnex_outstanding_cmd_free(mcxnex_state_t *state,
    mcxnex_cmd_t **cmd_ptr);
static int mcxnex_write_hcr(mcxnex_state_t *state, mcxnex_cmd_post_t *cmdpost,
    uint16_t token, int *hwerr);
static void mcxnex_mbox_sync(mcxnex_mbox_t *, uint_t, uint_t, uint_t);
static void mcxnex_cmd_check_status(mcxnex_state_t *, int);

/*
 * mcxnex_cmd_post()
 *    Context: Can be called from interrupt or base context.
 *
 *    The "cp_flags" field in cmdpost
 *    is used to determine whether to wait for an available
 *    outstanding command (if necessary) or to return error.
 */
int
mcxnex_cmd_post(mcxnex_state_t *state, mcxnex_cmd_post_t *cmdpost)
{
	mcxnex_cmd_t	*cmdptr;
	int		status, retry_cnt, retry_cnt2, hw_err;
	uint16_t	token;

	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*cmdpost))

	/* Determine if we are going to spin until completion */
	if (cmdpost->cp_flags == DDI_NOSLEEP) {

		/* Write the command to the HCR */
		retry_cnt = HCA_PIO_RETRY_CNT;
		do {
			status = mcxnex_write_hcr(state, cmdpost, 0, &hw_err);
		} while (status == MCXNEX_CMD_INTERNAL_ERR && retry_cnt-- > 0);

		/* Check if there is an error status in mcxnex_write_hcr() */
		if (status != MCXNEX_CMD_SUCCESS) {
			/*
			 * If there is a HW error, call mcxnex_cmd_retry_ok()
			 * to check the side-effect of the operation retry.
			 */
			if ((retry_cnt == HCA_PIO_RETRY_CNT &&
			    hw_err == HCA_PIO_OK) ||
			    !mcxnex_cmd_retry_ok(cmdpost, status)) {
				mcxnex_cmd_check_status(state, status);
				return (status);
			}
		/* Check if there is a transient internal error */
		} else if (retry_cnt != HCA_PIO_RETRY_CNT) {
			mcxnex_fm_ereport(state, HCA_IBA_ERR,
			    HCA_ERR_TRANSIENT);
		}

	} else {  /* "DDI_SLEEP" */
		ASSERT(MCXNEX_SLEEPFLAG_FOR_CONTEXT() != DDI_NOSLEEP);

		/* NOTE: Expect threads to be waiting in here */
		status = mcxnex_outstanding_cmd_alloc(state, &cmdptr,
		    cmdpost->cp_flags);
		if (status != MCXNEX_CMD_SUCCESS) {
			return (status);
		}
		_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*cmdptr))

		retry_cnt = HCA_PIO_RETRY_CNT;
retry:
		/*
		 * Set status to "MCXNEX_CMD_INVALID_STATUS".  It is
		 * appropriate to do this here without the "cmd_comp_lock"
		 * because this register is overloaded.  Later it will be
		 * used to indicate - through a change from this invalid
		 * value to some other value - that the condition variable
		 * has been signaled.  Once it has, status will then contain
		 * the _real_ completion status
		 */
		cmdptr->cmd_status = MCXNEX_CMD_INVALID_STATUS;

		/* Write the command to the HCR */
		token = (uint16_t)cmdptr->cmd_indx;
		retry_cnt2 = HCA_PIO_RETRY_CNT;
		do {
			status = mcxnex_write_hcr(state, cmdpost, token,
			    &hw_err);
		} while (status == MCXNEX_CMD_INTERNAL_ERR && retry_cnt2-- > 0);

		/* Check if there is an error status in mcxnex_write_hcr() */
		if (status != MCXNEX_CMD_SUCCESS) {
			/*
			 * If there is a HW error, call mcxnex_cmd_retry_ok()
			 * to check the side-effect of the operation retry.
			 */
			if ((retry_cnt == HCA_PIO_RETRY_CNT &&
			    hw_err == HCA_PIO_OK) ||
			    !mcxnex_cmd_retry_ok(cmdpost, status)) {
				mcxnex_cmd_check_status(state, status);
				mcxnex_outstanding_cmd_free(state, &cmdptr);
				return (status);
			}
		/* Check if there is a transient internal error */
		} else if (retry_cnt2 != HCA_PIO_RETRY_CNT) {
			mcxnex_fm_ereport(state, HCA_IBA_ERR,
			    HCA_ERR_TRANSIENT);
		}

		/*
		 * cv_wait() on the "command_complete" condition variable.
		 * Note: We have the "__lock_lint" here to workaround warlock.
		 * Since warlock doesn't know that other parts of the Mcxnex
		 * may occasionally call this routine while holding their own
		 * locks, it complains about this cv_wait.  In reality,
		 * however, the rest of the driver never calls this routine
		 * with a lock held unless they pass MCXNEX_CMD_NOSLEEP.
		 */
		_NOTE(NOW_VISIBLE_TO_OTHER_THREADS(*cmdptr))
		mutex_enter(&cmdptr->cmd_comp_lock);
		while (cmdptr->cmd_status == MCXNEX_CMD_INVALID_STATUS) {
#ifndef	__lock_lint
			cv_wait(&cmdptr->cmd_comp_cv, &cmdptr->cmd_comp_lock);
			/* NOTE: EXPECT SEVERAL THREADS TO BE WAITING HERE */
#endif
		}
		mutex_exit(&cmdptr->cmd_comp_lock);
		_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*cmdptr))

