Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cmd.c
		/*
		 * Wake up after command completes (cv_signal).  Read status
		 * from the command (success, fail, etc.).  It is appropriate
		 * here (as above) to read the status field without the
		 * "cmd_comp_lock" because it is no longer being used to
		 * indicate whether the condition variable has been signaled
		 * (i.e. at this point we are certain that it already has).
		 */
		status = cmdptr->cmd_status;

		/* retry the operation if an internal error occurs */
		if (status == MCXNEX_CMD_INTERNAL_ERR && retry_cnt-- > 0)
			goto retry;

		/* Save the "outparam" values into the cmdpost struct */
		cmdpost->cp_outparm = cmdptr->cmd_outparm;

		/*
		 * Add the command back to the "outstanding commands list".
		 * Signal the "cmd_list" condition variable, if necessary.
		 */
		mcxnex_outstanding_cmd_free(state, &cmdptr);

		/* Check if there is an error status in mcxnex_write_hcr() */
		if (status != MCXNEX_CMD_SUCCESS) {
			/*
			 * If there is a HW error, call mcxnex_cmd_retry_ok()
			 * to check the side-effect of the operation retry.
			 */
			if ((retry_cnt == HCA_PIO_RETRY_CNT &&
			    hw_err == HCA_PIO_OK) ||
			    !mcxnex_cmd_retry_ok(cmdpost, status)) {
				mcxnex_cmd_check_status(state, status);
				cmn_err(CE_NOTE, "mcxnex%d: post cmd failed "
				    "opcode (0x%x) status (0x%x)\n",
				    state->hs_instance, cmdpost->cp_opcode,
				    status);
				return (status);
			}
		/* Check if there is a transient internal error */
		} else if (retry_cnt != HCA_PIO_RETRY_CNT) {
			mcxnex_fm_ereport(state, HCA_IBA_ERR,
			    HCA_ERR_TRANSIENT);
		}
	}

	return (MCXNEX_CMD_SUCCESS);
}

/*
 * mcxnex_cmd_check_status()
 *	Context:  Can be called from interrupt or base
 *
 * checks the status returned from write_hcr and does the right
 * notice to the console, if any
 */
static void
mcxnex_cmd_check_status(mcxnex_state_t *state, int status)
{
	switch (status) {
	case MCXNEX_CMD_TIMEOUT_TOGGLE:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_TOTOG);
		mcxnex_fm_ereport(state, HCA_IBA_ERR, HCA_ERR_NON_FATAL);
		break;

	case MCXNEX_CMD_TIMEOUT_GOBIT:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_GOBIT);
		mcxnex_fm_ereport(state, HCA_IBA_ERR, HCA_ERR_NON_FATAL);
		break;

	case MCXNEX_CMD_INSUFF_RSRC:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_RSRC);
		break;

	case MCXNEX_CMD_INVALID_STATUS:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_CMDINV);
		mcxnex_fm_ereport(state, HCA_IBA_ERR, HCA_ERR_NON_FATAL);
		break;

	case MCXNEX_CMD_INTERNAL_ERR:
		MCXNEX_FMANOTE(state, MCXNEX_FMA_HCRINT);
		mcxnex_fm_ereport(state, HCA_IBA_ERR, HCA_ERR_NON_FATAL);
		break;

	case MCXNEX_CMD_BAD_NVMEM:
		/*
		 * No need of an ereport here since this case
		 * is treated as a degradation later.
		 */
		MCXNEX_FMANOTE(state, MCXNEX_FMA_NVMEM);
		break;

	default:
		break;
	}
}

/*
 * mcxnex_mbox_alloc()
 *    Context: Can be called from interrupt or base context.
 *
 *    The "mbox_wait" parameter is used to determine whether to
 *    wait for a mailbox to become available or not.
 */
int
mcxnex_mbox_alloc(mcxnex_state_t *state, mcxnex_mbox_info_t *mbox_info,
    uint_t mbox_wait)
{
	int		status;
	uint_t		sleep_context;

	sleep_context = MCXNEX_SLEEPFLAG_FOR_CONTEXT();

	/* Allocate an "In" mailbox */
	if (mbox_info->mbi_alloc_flags & MCXNEX_ALLOC_INMBOX) {
		/* Determine correct mboxlist based on calling context */
		if (sleep_context == DDI_NOSLEEP) {
			status = mcxnex_impl_mbox_alloc(state,
			    &state->hs_in_intr_mblist,
			    &mbox_info->mbi_in, mbox_wait);

			ASSERT(status == MCXNEX_CMD_SUCCESS);
		} else {
			/* NOTE: Expect threads to be waiting in here */
			status = mcxnex_impl_mbox_alloc(state,
			    &state->hs_in_mblist, &mbox_info->mbi_in,
			    mbox_wait);
			if (status != MCXNEX_CMD_SUCCESS) {
				return (status);
			}
		}

	}

	/* Allocate an "Out" mailbox */
	if (mbox_info->mbi_alloc_flags & MCXNEX_ALLOC_OUTMBOX) {
		/* Determine correct mboxlist based on calling context */
		if (sleep_context == DDI_NOSLEEP) {
			status = mcxnex_impl_mbox_alloc(state,
			    &state->hs_out_intr_mblist,
			    &mbox_info->mbi_out, mbox_wait);

			ASSERT(status == MCXNEX_CMD_SUCCESS);
		} else {
			/* NOTE: Expect threads to be waiting in here */
			status = mcxnex_impl_mbox_alloc(state,
			    &state->hs_out_mblist, &mbox_info->mbi_out,
			    mbox_wait);
			if (status != MCXNEX_CMD_SUCCESS) {
				/* If we allocated an "In" mailbox, free it */
				if (mbox_info->mbi_alloc_flags &
				    MCXNEX_ALLOC_INMBOX) {
					mcxnex_impl_mbox_free(
					    &state->hs_in_mblist,
					    &mbox_info->mbi_in);
				}
				return (status);
			}
		}
	}

	/* Store appropriate context in mbox_info */
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(mbox_info->mbi_sleep_context))
	mbox_info->mbi_sleep_context = sleep_context;

	return (MCXNEX_CMD_SUCCESS);
}


/*
 * mcxnex_mbox_free()
 *    Context: Can be called from interrupt or base context.
 */
void
mcxnex_mbox_free(mcxnex_state_t *state, mcxnex_mbox_info_t *mbox_info)
{
	/*
	 * The mailbox has to be freed in the same context from which it was
	 * allocated.  The context is stored in the mbox_info at
	 * mcxnex_mbox_alloc() time.  We check the stored context against the
	 * current context here.
	 */
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(mbox_info->mbi_sleep_context))
	ASSERT(mbox_info->mbi_sleep_context == MCXNEX_SLEEPFLAG_FOR_CONTEXT());

	/* Determine correct mboxlist based on calling context */
	if (mbox_info->mbi_sleep_context == DDI_NOSLEEP) {
		/* Free the intr "In" mailbox */
		if (mbox_info->mbi_alloc_flags & MCXNEX_ALLOC_INMBOX) {
			mcxnex_impl_mbox_free(&state->hs_in_intr_mblist,
			    &mbox_info->mbi_in);
		}

		/* Free the intr "Out" mailbox */
		if (mbox_info->mbi_alloc_flags & MCXNEX_ALLOC_OUTMBOX) {
			mcxnex_impl_mbox_free(&state->hs_out_intr_mblist,
			    &mbox_info->mbi_out);
		}
	} else {
		/* Free the "In" mailbox */
		if (mbox_info->mbi_alloc_flags & MCXNEX_ALLOC_INMBOX) {
			mcxnex_impl_mbox_free(&state->hs_in_mblist,
			    &mbox_info->mbi_in);
		}

		/* Free the "Out" mailbox */
		if (mbox_info->mbi_alloc_flags & MCXNEX_ALLOC_OUTMBOX) {
			mcxnex_impl_mbox_free(&state->hs_out_mblist,
			    &mbox_info->mbi_out);
		}
	}
}



