Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cmd.c
/*
 * mcxnex_cmd_complete_handler()
 *    Context: Called only from interrupt context.
 */
int
mcxnex_cmd_complete_handler(mcxnex_state_t *state, mcxnex_eqhdl_t eq,
    mcxnex_hw_eqe_t *eqe)
{
	mcxnex_cmd_t		*cmdp;
	uint_t			eqe_evttype;

	eqe_evttype = MCXNEX_EQE_EVTTYPE_GET(eq, eqe);

	ASSERT(eqe_evttype == MCXNEX_EVT_COMMAND_INTF_COMP ||
	    eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW);

	if (eqe_evttype == MCXNEX_EVT_EQ_OVERFLOW) {
		mcxnex_eq_overflow_handler(state, eq, eqe);
		return (DDI_FAILURE);
	}

	/*
	 * Find the outstanding command pointer based on value returned
	 * in "token"
	 */
	cmdp = &state->hs_cmd_list.cml_cmd[MCXNEX_EQE_CMDTOKEN_GET(eq, eqe)];

	/* Signal the waiting thread */
	mutex_enter(&cmdp->cmd_comp_lock);
	cmdp->cmd_outparm = ((uint64_t)MCXNEX_EQE_CMDOUTP0_GET(eq, eqe) << 32) |
	    MCXNEX_EQE_CMDOUTP1_GET(eq, eqe);
	cmdp->cmd_status = MCXNEX_EQE_CMDSTATUS_GET(eq, eqe);

	cv_signal(&cmdp->cmd_comp_cv);
	mutex_exit(&cmdp->cmd_comp_lock);

	return (DDI_SUCCESS);
}


/*
 * mcxnex_inmbox_list_init()
 *    Context: Only called from attach() path context
 */
int
mcxnex_inmbox_list_init(mcxnex_state_t *state)
{
	int		status;
	uint_t		num_inmbox;

	/* Initialize the "In" mailbox list */
	num_inmbox  =  (1 << state->hs_cfg_profile->cp_log_num_inmbox);
	status = mcxnex_impl_mboxlist_init(state, &state->hs_in_mblist,
	    num_inmbox, MCXNEX_IN_MBOX);
	if (status != DDI_SUCCESS) {
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_intr_inmbox_list_init()
 *    Context: Only called from attach() path context
 */
int
mcxnex_intr_inmbox_list_init(mcxnex_state_t *state)
{
	int		status;
	uint_t		num_inmbox;

	/* Initialize the interrupt "In" mailbox list */
	num_inmbox  =  (1 << state->hs_cfg_profile->cp_log_num_intr_inmbox);
	status = mcxnex_impl_mboxlist_init(state, &state->hs_in_intr_mblist,
	    num_inmbox, MCXNEX_INTR_IN_MBOX);
	if (status != DDI_SUCCESS) {
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_outmbox_list_init()
 *    Context: Only called from attach() path context
 */
int
mcxnex_outmbox_list_init(mcxnex_state_t *state)
{
	int		status;
	uint_t		num_outmbox;

	/* Initialize the "Out" mailbox list */
	num_outmbox  =  (1 << state->hs_cfg_profile->cp_log_num_outmbox);
	status = mcxnex_impl_mboxlist_init(state, &state->hs_out_mblist,
	    num_outmbox, MCXNEX_OUT_MBOX);
	if (status != DDI_SUCCESS) {
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_intr_outmbox_list_init()
 *    Context: Only called from attach() path context
 */
int
mcxnex_intr_outmbox_list_init(mcxnex_state_t *state)
{
	int		status;
	uint_t		num_outmbox;

	/* Initialize the interrupts "Out" mailbox list */
	num_outmbox  =  (1 << state->hs_cfg_profile->cp_log_num_intr_outmbox);
	status = mcxnex_impl_mboxlist_init(state, &state->hs_out_intr_mblist,
	    num_outmbox, MCXNEX_INTR_OUT_MBOX);
	if (status != DDI_SUCCESS) {
		return (DDI_FAILURE);
	}

	return (DDI_SUCCESS);
}


/*
 * mcxnex_inmbox_list_fini()
 *    Context: Only called from attach() and/or detach() path contexts
 */
void
mcxnex_inmbox_list_fini(mcxnex_state_t *state)
{
	/* Free up the "In" mailbox list */
	mcxnex_impl_mboxlist_fini(state, &state->hs_in_mblist);
}


/*
 * mcxnex_intr_inmbox_list_fini()
 *    Context: Only called from attach() and/or detach() path contexts
 */
void
mcxnex_intr_inmbox_list_fini(mcxnex_state_t *state)
{
	/* Free up the interrupts "In" mailbox list */
	mcxnex_impl_mboxlist_fini(state, &state->hs_in_intr_mblist);
}


/*
 * mcxnex_outmbox_list_fini()
 *    Context: Only called from attach() and/or detach() path contexts
 */
void
mcxnex_outmbox_list_fini(mcxnex_state_t *state)
{
	/* Free up the "Out" mailbox list */
	mcxnex_impl_mboxlist_fini(state, &state->hs_out_mblist);
}


/*
 * mcxnex_intr_outmbox_list_fini()
 *    Context: Only called from attach() and/or detach() path contexts
 */
void
mcxnex_intr_outmbox_list_fini(mcxnex_state_t *state)
{
	/* Free up the interrupt "Out" mailbox list */
	mcxnex_impl_mboxlist_fini(state, &state->hs_out_intr_mblist);
}


/*
 * mcxnex_impl_mbox_alloc()
 *    Context: Can be called from interrupt or base context.
 */
static int
mcxnex_impl_mbox_alloc(mcxnex_state_t *state, mcxnex_mboxlist_t *mblist,
    mcxnex_mbox_t **mb, uint_t mbox_wait)
{
	mcxnex_mbox_t	*mbox_ptr;
	uint_t		index, next, prev;
	uint_t		count, countmax;

	/*
	 * If the mailbox list is empty, then wait (if appropriate in the
	 * current context).  Otherwise, grab the next available mailbox.
	 */
	if (mbox_wait == DDI_NOSLEEP) {
		count	 = 0;
		countmax = state->hs_cfg_profile->cp_cmd_poll_max;

		mutex_enter(&mblist->mbl_lock);
		mblist->mbl_pollers++;
		while (mblist->mbl_entries_free == 0) {
			mutex_exit(&mblist->mbl_lock);
			/* Delay loop polling for an available mbox */
			if (++count > countmax) {
				return (MCXNEX_CMD_INSUFF_RSRC);
			}

			/* Delay before polling for mailbox again */
			drv_usecwait(state->hs_cfg_profile->cp_cmd_poll_delay);
			mutex_enter(&mblist->mbl_lock);
		}
		mblist->mbl_pollers--;

	/* DDI_SLEEP */
	} else {
		/*
		 * Grab lock here as we prepare to cv_wait if needed.
		 */
		mutex_enter(&mblist->mbl_lock);
		while (mblist->mbl_entries_free == 0) {
			/*
			 * Wait (on cv) for a mailbox to become free.  Note:
			 * Just as we do above in mcxnex_cmd_post(), we also
			 * have the "__lock_lint" here to workaround warlock.
			 * Warlock doesn't know that other parts of the Mcxnex
			 * may occasionally call this routine while holding
			 * their own locks, so it complains about this cv_wait.
			 * In reality, however, the rest of the driver never
			 * calls this routine with a lock held unless they pass
			 * MCXNEX_CMD_NOSLEEP.
			 */
			mblist->mbl_waiters++;
#ifndef	__lock_lint
			cv_wait(&mblist->mbl_cv, &mblist->mbl_lock);
#endif
		}
	}

	/* Grab the next available mailbox from list */
	mbox_ptr = mblist->mbl_mbox;
	index	 = mblist->mbl_head_indx;
	next	 = mbox_ptr[index].mb_next;
	prev	 = mbox_ptr[index].mb_prev;

	/* Remove it from the mailbox list */
	mblist->mbl_mbox[next].mb_prev	= prev;
	mblist->mbl_mbox[prev].mb_next	= next;
	mblist->mbl_head_indx		= next;

	/* Update the "free" count and return the mailbox pointer */
	mblist->mbl_entries_free--;
	*mb = &mbox_ptr[index];

	mutex_exit(&mblist->mbl_lock);

	return (MCXNEX_CMD_SUCCESS);
}


