Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cmd.c
/*
 * mcxnex_outstanding_cmd_alloc()
 *    Context: Can be called only from base context.
 */
static int
mcxnex_outstanding_cmd_alloc(mcxnex_state_t *state, mcxnex_cmd_t **cmd_ptr,
    uint_t cmd_wait)
{
	mcxnex_cmdlist_t	*cmd_list;
	uint_t		next, prev, head;

	cmd_list = &state->hs_cmd_list;
	mutex_enter(&cmd_list->cml_lock);

	/* Ensure that outstanding commands are supported */
	ASSERT(cmd_list->cml_num_alloc != 0);

	/*
	 * If the outstanding command list is empty, then wait (if
	 * appropriate in the current context).  Otherwise, grab the
	 * next available command.
	 */
	while (cmd_list->cml_entries_free == 0) {
		/* No free commands */
		if (cmd_wait == DDI_NOSLEEP) {
			mutex_exit(&cmd_list->cml_lock);
			return (MCXNEX_CMD_INSUFF_RSRC);
		}

		/*
		 * Wait (on cv) for a command to become free.  Note: Just
		 * as we do above in mcxnex_cmd_post(), we also have the
		 * "__lock_lint" here to workaround warlock.  Warlock doesn't
		 * know that other parts of the Mcxnex may occasionally call
		 * this routine while holding their own locks, so it complains
		 * about this cv_wait.  In reality, however, the rest of the
		 * driver never calls this routine with a lock held unless
		 * they pass MCXNEX_CMD_NOSLEEP.
		 */
		cmd_list->cml_waiters++;
#ifndef	__lock_lint
		cv_wait(&cmd_list->cml_cv, &cmd_list->cml_lock);
#endif
	}

	/* Grab the next available command from the list */
	head = cmd_list->cml_head_indx;
	*cmd_ptr = &cmd_list->cml_cmd[head];
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(**cmd_ptr))
	next = (*cmd_ptr)->cmd_next;
	prev = (*cmd_ptr)->cmd_prev;
	(*cmd_ptr)->cmd_status = MCXNEX_CMD_INVALID_STATUS;

	/* Remove it from the command list */
	cmd_list->cml_cmd[next].cmd_prev = prev;
	cmd_list->cml_cmd[prev].cmd_next = next;
	cmd_list->cml_head_indx		 = next;

	/* Update the "free" count and return */
	cmd_list->cml_entries_free--;

	mutex_exit(&cmd_list->cml_lock);

	return (MCXNEX_CMD_SUCCESS);
}


/*
 * mcxnex_outstanding_cmd_free()
 *    Context: Can be called only from base context.
 */
static void
mcxnex_outstanding_cmd_free(mcxnex_state_t *state, mcxnex_cmd_t **cmd_ptr)
{
	mcxnex_cmdlist_t	*cmd_list;
	uint_t		cmd_indx;

	cmd_list = &state->hs_cmd_list;
	mutex_enter(&cmd_list->cml_lock);

	/* Pull the "index" from command entry */
	cmd_indx = (*cmd_ptr)->cmd_indx;

	/*
	 * If outstanding command list is not empty, then insert the entry.
	 * Otherwise, this is the only entry.  So update the pointers
	 * appropriately.
	 */
	if (cmd_list->cml_entries_free++ != 0) {
		/* Update the current command */
		(*cmd_ptr)->cmd_next = cmd_list->cml_head_indx;
		(*cmd_ptr)->cmd_prev = cmd_list->cml_tail_indx;

		/* Update head and tail commands */
		cmd_list->cml_cmd[cmd_list->cml_head_indx].cmd_prev = cmd_indx;
		cmd_list->cml_cmd[cmd_list->cml_tail_indx].cmd_next = cmd_indx;

		/* Update tail index */
		cmd_list->cml_tail_indx = cmd_indx;

	} else {
		/* Update the current command */
		(*cmd_ptr)->cmd_next = cmd_indx;
		(*cmd_ptr)->cmd_prev = cmd_indx;

		/* Update head and tail indexes */
		cmd_list->cml_head_indx = cmd_indx;
		cmd_list->cml_tail_indx = cmd_indx;
	}

	/* If there are threads waiting, signal one of them */
	if (cmd_list->cml_waiters > 0) {
		cmd_list->cml_waiters--;
		cv_signal(&cmd_list->cml_cv);
	}

	/* Clear out the command entry pointer */
	*cmd_ptr = NULL;

	mutex_exit(&cmd_list->cml_lock);
}


/*
 * mcxnex_write_hcr()
 *    Context: Can be called from interrupt or base context.
 */
static int
mcxnex_write_hcr(mcxnex_state_t *state, mcxnex_cmd_post_t *cmdpost,
    uint16_t token, int *hw_err)
{
	mcxnex_hw_hcr_t	*hcr;
	uint_t		status, count, countmax;
	uint64_t	hcrreg;
	uint64_t	togmask;
	ddi_acc_handle_t cmdhdl = mcxnex_get_cmdhdl(state);
	boolean_t	hw_error = B_FALSE;

	/* initialize the FMA retry loop */
	mcxnex_pio_init(fm_loop_cnt, fm_status, fm_test);

	/*
	 * Grab the "HCR access" lock if the driver is not in
	 * fastreboot. In fastreboot, this function is called
	 * with the single thread but in high interrupt context
	 * (so that this mutex lock cannot be used).
	 */
#ifdef __lock_lint
	mutex_enter(&state->hs_cmd_regs.hcr_lock);
#else
	if (!MCXNEX_IN_FASTREBOOT(state)) {
		mutex_enter(&state->hs_cmd_regs.hcr_lock);
	}
#endif
	hcr = state->hs_cmd_regs.hcr;

	/*
	 * First, check the "go" bit to see if any previous hcr usage is
	 * complete.  As long as it is set then we must continue to poll.
	 */

	countmax = state->hs_cfg_profile->cp_cmd_poll_max;
	togmask = (state->hs_cmd_toggle & 0x01) << MCXNEX_HCR_CMD_T_SHFT;

	/* the FMA retry loop starts. */
	mcxnex_pio_start(state, cmdhdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);

	count	 = 0;
	for (;;) {
		hcrreg = ddi_get32(cmdhdl, &hcr->cmd);

		/* If "go" bit is clear and toggle reset, then done */
		if (((hcrreg & MCXNEX_HCR_CMD_GO_MASK) == 0) &&
		    ((hcrreg & MCXNEX_HCR_CMD_T_MASK)  == togmask)) {
			break;
		}
		/* Delay before polling the "go" bit again */
		drv_usecwait(state->hs_cfg_profile->cp_cmd_poll_delay);

		/*
		 * If we poll more than the maximum number of times, then
		 * return a "timeout" error.
		 */
		if (++count > countmax) {
#ifdef __lock_lint
			mutex_exit(&state->hs_cmd_regs.hcr_lock);
#else
			if (!MCXNEX_IN_FASTREBOOT(state)) {
				mutex_exit(&state->hs_cmd_regs.hcr_lock);
			}
#endif
			cmn_err(CE_NOTE, "write_hcr: cannot start cmd");
			return (MCXNEX_CMD_TIMEOUT_GOBIT);
		}
	}

	/* the FMA retry loop ends. */
	mcxnex_pio_end(state, cmdhdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);

	/* check if there is a transient error */
	if (fm_loop_cnt != HCA_PIO_RETRY_CNT) {
		hw_error = B_TRUE;
	}

	/* succeeded, so update the cmd counter for this cmd's completion */
	state->hs_cmd_toggle++;
	togmask = (state->hs_cmd_toggle & 0x01) << MCXNEX_HCR_CMD_T_SHFT;

	/* the FMA retry loop starts. */
	mcxnex_pio_start(state, cmdhdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);

	/* Write "inparam" as a 64-bit quantity */
	ddi_put64(cmdhdl, (uint64_t *)(void *)&hcr->in_param0,
	    cmdpost->cp_inparm);

