Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cmd.c
	/* Write "inmod" and 32-bits of "outparam" as 64-bit */
	hcrreg = ((uint64_t)cmdpost->cp_inmod << 32);
	hcrreg = hcrreg | (cmdpost->cp_outparm >> 32);

	ddi_put64(cmdhdl, (uint64_t *)(void *)&hcr->input_modifier, hcrreg);

	/* Write the other 32-bits of "outparam" and "token" as 64-bit */
	hcrreg = (cmdpost->cp_outparm << 32);
	hcrreg = hcrreg | ((uint32_t)token << MCXNEX_HCR_TOKEN_SHIFT);

	ddi_put64(cmdhdl, (uint64_t *)(void *)&hcr->out_param1, hcrreg);

	/* Then setup the final hcrreg to hit doorbell (i.e. "go" bit) */
	hcrreg = MCXNEX_HCR_CMD_GO_MASK;
	/* Then set the toggle bit for this command */
	hcrreg |= (state->hs_cmd_toggle & 0x01) << MCXNEX_HCR_CMD_T_SHFT;
	if (cmdpost->cp_flags == DDI_SLEEP) {
		hcrreg = hcrreg | MCXNEX_HCR_CMD_E_MASK;
	}
	hcrreg = hcrreg | (cmdpost->cp_opmod << MCXNEX_HCR_CMD_OPMOD_SHFT);
	hcrreg = hcrreg | (cmdpost->cp_opcode);

	/* Write the doorbell to the HCR */
	ddi_put32(cmdhdl, &hcr->cmd, hcrreg);

	/* the FMA retry loop ends. */
	mcxnex_pio_end(state, cmdhdl, pio_error, fm_loop_cnt, fm_status,
	    fm_test);

	/* check if there is a transient error */
	if (fm_loop_cnt != HCA_PIO_RETRY_CNT) {
		hw_error = B_TRUE;
	}

	/*
	 * In the SPIN case we read the HCR and check the "go" bit.  For the
	 * NOSPIN case we do not have to poll, we simply release the HCR lock
	 * and return.
	 */
	if (cmdpost->cp_flags == DDI_NOSLEEP) {

		countmax = (state->hs_cfg_profile->cp_cmd_poll_max << 4);

		/* the FMA retry loop starts. */
		mcxnex_pio_start(state, cmdhdl, pio_error, fm_loop_cnt,
		    fm_status, fm_test);

		count	 = 0;
		for (;;) {
			hcrreg = ddi_get32(cmdhdl, &hcr->cmd);

			/* If "go" bit is clear and toggle reset, then done */
			if (((hcrreg & MCXNEX_HCR_CMD_GO_MASK) == 0) &&
			    ((hcrreg & MCXNEX_HCR_CMD_T_MASK)  == togmask)) {
				break;
			}
			/* Delay before polling the "go" bit again */
			drv_usecwait(state->hs_cfg_profile->cp_cmd_poll_delay);

			/*
			 * If we poll more than the maximum number of times,
			 * then return a "timeout" error.
			 */
			if (++count > countmax) {
#ifdef __lock_lint
				mutex_exit(&state-> hs_cmd_regs.hcr_lock);
#else
				if (!MCXNEX_IN_FASTREBOOT(state)) {
					mutex_exit(&state->
					    hs_cmd_regs.hcr_lock);
				}
#endif
				cmn_err(CE_NOTE,
				    "write_hcr: cannot complete cmd");
				return (MCXNEX_CMD_TIMEOUT_GOBIT);
			}
		}

		/* Pull out the "status" bits from the HCR */
		status = (hcrreg >> MCXNEX_HCR_CMD_STATUS_SHFT);

		/*
		 * Read the "outparam" value.  Note: we have to read "outparam"
		 * as two separate 32-bit reads because the field in the HCR is
		 * not 64-bit aligned.
		 */
		hcrreg = ddi_get32(cmdhdl, &hcr->out_param0);
		cmdpost->cp_outparm = hcrreg << 32;
		hcrreg = ddi_get32(cmdhdl, &hcr->out_param1);
		cmdpost->cp_outparm |= hcrreg;

		/* the FMA retry loop ends. */
		mcxnex_pio_end(state, cmdhdl, pio_error, fm_loop_cnt, fm_status,
		    fm_test);

		/* check if there is a transient error */
		if (fm_loop_cnt != HCA_PIO_RETRY_CNT) {
			hw_error = B_TRUE;
		}

	/* END SPIN */
	} else {		/* NOSPIN */
		status = MCXNEX_CMD_SUCCESS;
	}

	/* Drop the "HCR access" lock */
#ifdef __lock_lint
	mutex_exit(&state->hs_cmd_regs.hcr_lock);
#else
	if (!MCXNEX_IN_FASTREBOOT(state)) {
		mutex_exit(&state->hs_cmd_regs.hcr_lock);
	}
#endif
	if (hw_error == B_TRUE) {
		*hw_err = HCA_PIO_TRANSIENT;
	} else {
		*hw_err = HCA_PIO_OK;
	}
#ifdef FMA_TEST
	if (mcxnex_test_num == -3) {
		status = MCXNEX_CMD_INTERNAL_ERR;
	}
#endif
	return (status);

pio_error:
#ifdef __lock_lint
	mutex_exit(&state->hs_cmd_regs.hcr_lock);
#else
	if (!MCXNEX_IN_FASTREBOOT(state)) {
		mutex_exit(&state->hs_cmd_regs.hcr_lock);
	}
#endif
	mcxnex_fm_ereport(state, HCA_SYS_ERR, HCA_ERR_NON_FATAL);
	*hw_err = HCA_PIO_PERSISTENT;
	return (MCXNEX_CMD_INVALID_STATUS);
}


/*
 * mcxnex_outstanding_cmdlist_init()
 *    Context: Only called from attach() path context
 */
int
mcxnex_outstanding_cmdlist_init(mcxnex_state_t *state)
{
	uint_t		num_outstanding_cmds, head, tail;
	int		i;

	/*
	 * Determine the number of the outstanding commands supported
	 * by the Mcxnex device (obtained from the QUERY_FW command).  Note:
	 * Because we handle both SLEEP and NOSLEEP cases around the mcxnex HCR,
	 * we know that when an interrupt comes in it will be next on the
	 * command register, and will at most have to wait one commands time.
	 * We do not have to reserve an outstanding command here for
	 * interrupts.
	 */
	num_outstanding_cmds = (1 << state->hs_fw.log_max_cmd);

	/* Initialize the outstanding command list */
	state->hs_cmd_list.cml_list_sz	 = num_outstanding_cmds;
	state->hs_cmd_list.cml_head_indx = 0;
	state->hs_cmd_list.cml_tail_indx = state->hs_cmd_list.cml_list_sz - 1;
	state->hs_cmd_list.cml_entries_free = state->hs_cmd_list.cml_list_sz;
	state->hs_cmd_list.cml_waiters	 = 0;
	state->hs_cmd_list.cml_num_alloc = 0;

	/* Allocate the memory for the outstanding command list */
	if (num_outstanding_cmds) {
		state->hs_cmd_list.cml_cmd =
		    kmem_zalloc(state->hs_cmd_list.cml_list_sz *
		    sizeof (mcxnex_cmd_t), KM_SLEEP);
	}
	mutex_init(&state->hs_cmd_list.cml_lock, NULL, MUTEX_DRIVER,
	    DDI_INTR_PRI(state->hs_intrmsi_pri));
	cv_init(&state->hs_cmd_list.cml_cv, NULL, CV_DRIVER, NULL);

	/* Initialize the individual outstanding command list entries */
	for (i = 0; i < state->hs_cmd_list.cml_list_sz; i++) {
		mutex_init(&state->hs_cmd_list.cml_cmd[i].cmd_comp_lock,
		    NULL, MUTEX_DRIVER, DDI_INTR_PRI(state->hs_intrmsi_pri));
		cv_init(&state->hs_cmd_list.cml_cmd[i].cmd_comp_cv, NULL,
		    CV_DRIVER, NULL);

		state->hs_cmd_list.cml_cmd[i].cmd_next	= i+1;
		state->hs_cmd_list.cml_cmd[i].cmd_prev	= i-1;
		state->hs_cmd_list.cml_cmd[i].cmd_indx	= i;
		state->hs_cmd_list.cml_num_alloc	= i + 1;
	}
	if (num_outstanding_cmds) {
		head = state->hs_cmd_list.cml_head_indx;
		tail = state->hs_cmd_list.cml_tail_indx;
		state->hs_cmd_list.cml_cmd[head].cmd_prev =
		    state->hs_cmd_list.cml_tail_indx;
		state->hs_cmd_list.cml_cmd[tail].cmd_next =
		    state->hs_cmd_list.cml_head_indx;
	}

	return (DDI_SUCCESS);
}


