Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cmd.c
/*
 * mcxnex_outstanding_cmdlist_fini()
 *    Context: Only called from attach() and/or detach() path contexts
 */
void
mcxnex_outstanding_cmdlist_fini(mcxnex_state_t *state)
{
	int		i;

	/* Destroy the outstanding command list entries */
	for (i = 0; i < state->hs_cmd_list.cml_num_alloc; i++) {
		mutex_destroy(&state->hs_cmd_list.cml_cmd[i].cmd_comp_lock);
		cv_destroy(&state->hs_cmd_list.cml_cmd[i].cmd_comp_cv);
	}

	/* Destroy the lock (and cv) and free up memory for list */
	mutex_destroy(&state->hs_cmd_list.cml_lock);
	cv_destroy(&state->hs_cmd_list.cml_cv);
	if (state->hs_cmd_list.cml_num_alloc) {
		kmem_free(state->hs_cmd_list.cml_cmd,
		    state->hs_cmd_list.cml_list_sz * sizeof (mcxnex_cmd_t));
	}
}


/*
 * mcxnex_mbox_sync()
 */
static void
mcxnex_mbox_sync(mcxnex_mbox_t *mbox, uint_t offset, uint_t length, uint_t flag)
{
	ddi_dma_handle_t	dmahdl;
	int			status;

	/* Get the DMA handle from mailbox */
	dmahdl = mbox->mb_rsrcptr->hr_dmahdl;

	/* Calculate offset into mailbox */
	status = ddi_dma_sync(dmahdl, (off_t)offset, (size_t)length, flag);
	if (status != DDI_SUCCESS) {
		return;
	}
}


/*
 * mcxnex_init_hca_cmd_post()
 *    Context: Can be called from interrupt or base context.
 *    (Currently called only from attach() path context)
 */
int
mcxnex_init_hca_cmd_post(mcxnex_state_t *state,
    mcxnex_hw_initqueryhca_t *inithca, uint_t sleepflag)
{
	mcxnex_mbox_info_t		mbox_info;
	mcxnex_cmd_post_t	cmd;
	uint64_t		data;
	uint_t			size;
	int			status, i;

	/* Make sure we are called with the correct flag */
	ASSERT(sleepflag == DDI_NOSLEEP);

	bzero(&cmd, sizeof (cmd));

	/* Get an "In" mailbox for the command */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_INMBOX;
	status = mcxnex_mbox_alloc(state, &mbox_info, sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		return (status);
	}

	/* Copy the Mcxnex "INIT_HCA" command into the mailbox */
	size = sizeof (mcxnex_hw_initqueryhca_t);
	for (i = 0; i < (size >> 3); i++) {
		data = ((uint64_t *)inithca)[i];
		ddi_put64(mbox_info.mbi_in->mb_acchdl,
		    ((uint64_t *)mbox_info.mbi_in->mb_addr + i), data);
	}

	/* Sync the mailbox for the device to read */
	mcxnex_mbox_sync(mbox_info.mbi_in, 0, size, DDI_DMA_SYNC_FORDEV);

	/* Setup and post the Mcxnex "INIT_HCA" command */
	cmd.cp_inparm	= mbox_info.mbi_in->mb_mapaddr;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= 0;
	cmd.cp_opcode	= INIT_HCA;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= sleepflag;
	status = mcxnex_cmd_post(state, &cmd);

	/* Free the mailbox */
	mcxnex_mbox_free(state, &mbox_info);
	return (status);
}


/*
 * mcxnex_close_hca_cmd_post()
 *    Context: Can be called from interrupt or base context.
 *    (Currently called only from attach() and/or detach() path contexts)
 */
int
mcxnex_close_hca_cmd_post(mcxnex_state_t *state, uint_t sleepflag)
{
	mcxnex_cmd_post_t	cmd;
	int			status;

	/* Make sure we are called with the correct flag */
	ASSERT(sleepflag == DDI_NOSLEEP);

	bzero(&cmd, sizeof (cmd));


	/* Setup and post the Mcxnex "CLOSE_HCA" command */
	cmd.cp_inparm	= 0;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= 0;
	cmd.cp_opcode	= CLOSE_HCA;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= sleepflag;
	status = mcxnex_cmd_post(state, &cmd);
	return (status);
}


/*
 * mcxnex_set_port_cmd_post()
 *    Context: Can be called from interrupt or base context.
 *    (Currently called only from attach() path context)
 */
int
mcxnex_set_port_cmd_post(mcxnex_state_t *state, mcxnex_hw_set_port_t *initport,
    uint_t port, uint_t sleepflag)
{
	mcxnex_mbox_info_t		mbox_info;
	mcxnex_cmd_post_t	cmd;
	uint64_t		data;
	uint_t			size;
	int			status, i;

	bzero(&cmd, sizeof (cmd));

	/* Get an "In" mailbox for the command */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_INMBOX;
	status = mcxnex_mbox_alloc(state, &mbox_info, sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		return (status);
	}

	/* Copy the Mcxnex "INIT_PORT" command into the mailbox */
	size = sizeof (mcxnex_hw_set_port_t);
	for (i = 0; i < (size >> 3); i++) {
		data = ((uint64_t *)initport)[i];
		ddi_put64(mbox_info.mbi_in->mb_acchdl,
		    ((uint64_t *)mbox_info.mbi_in->mb_addr + i), data);
	}

	/* Sync the mailbox for the device to read */
	mcxnex_mbox_sync(mbox_info.mbi_in, 0, size, DDI_DMA_SYNC_FORDEV);

	/* Setup and post the Mcxnex "SET_PORT" command */
	cmd.cp_inparm	= mbox_info.mbi_in->mb_mapaddr;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= port;
	cmd.cp_opcode	= SET_PORT;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= sleepflag;
	status = mcxnex_cmd_post(state, &cmd);

	/* Free the mailbox */
	mcxnex_mbox_free(state, &mbox_info);
	return (status);
}


/*
 * mcxnex_init_port_cmd_post()
 *    Context: Can be called from interrupt or base context.
 *    (Currently called only from attach() and/or detach() path contexts)
 */
int
mcxnex_init_port_cmd_post(mcxnex_state_t *state, uint_t port, uint_t sleepflag)
{
	mcxnex_cmd_post_t	cmd;
	int			status;

	bzero(&cmd, sizeof (cmd));

	/* Setup and post the "INIT_PORT" command */
	cmd.cp_inparm	= 0;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= port;
	cmd.cp_opcode	= INIT_PORT;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= sleepflag;
	status = mcxnex_cmd_post(state, &cmd);

	return (status);
}


/*
 * mcxnex_close_port_cmd_post()
 *    Context: Can be called from interrupt or base context.
 *    (Currently called only from attach() and/or detach() path contexts)
 */
int
mcxnex_close_port_cmd_post(mcxnex_state_t *state, uint_t port, uint_t sleepflag)
{
	mcxnex_cmd_post_t	cmd;
	int			status;

	bzero(&cmd, sizeof (cmd));

	/* Setup and post the "CLOSE_PORT" command */
	cmd.cp_inparm	= 0;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= port;
	cmd.cp_opcode	= CLOSE_PORT;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= sleepflag;
	status = mcxnex_cmd_post(state, &cmd);
	return (status);
}


/*
 * mcxnex_mod_stat_cfg_cmd_post()
 *    Context: Can be called only from attach() path
 *
 * This routine was initially implemented to enable SRQ. That's no longer needed
 * in mcxnex, and the code is conditionally compiled OUT, but left here because
 * there are other static configuration parameters we might one day want to set
 */
#ifdef MCXNEX_NO_MOD_STAT_CFG
int
mcxnex_mod_stat_cfg_cmd_post(mcxnex_state_t *state)
{
	mcxnex_mbox_info_t		mbox_info;
	mcxnex_cmd_post_t	cmd;
	mcxnex_hw_mod_stat_cfg_t	*mod;
	mcxnex_hw_msg_in_mod_t	inmod;
	uint64_t		data;
	uint_t			size;
	int			status, i;

	bzero(&cmd, sizeof (cmd));

