Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cmd.c
	/*
	 * "MOD_STAT_CFG" needs an INMBOX parameter, to specify what operations
	 * to do.  However, at the point in time that we call this command, the
	 * DDR has not yet been initialized, and all INMBOX'es are located in
	 * DDR.  Because we want to call MOD_STAT_CFG before QUERY_DEVLIM is
	 * called, and thus call it before DDR is setup, we simply use an
	 * OUTMBOX memory location here as our INMBOX parameter.
	 */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_OUTMBOX;
	status = mcxnex_mbox_alloc(state, &mbox_info, DDI_NOSLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		return (status);
	}

	/*
	 * Allocate on the heap our 'mod_stat_cfg' structure.  We want to
	 * ideally move all of this on to the stack in the future, but this
	 * works well for now.
	 */
	mod = (mcxnex_hw_mod_stat_cfg_t *)kmem_zalloc(
	    sizeof (mcxnex_hw_mod_stat_cfg_t), KM_SLEEP);

	/* Setup "MOD_STAT_CFG" settings */
	mod->srq_m	= 1;
	mod->srq	= state->hs_cfg_profile->cp_srq_enable;

	if (mod->srq) {
		/*  use DEV_LIMS num srq */
		mod->log_max_srq = state->hs_cfg_profile->cp_log_num_srq;
	} else {
		mod->log_max_srq = 0;
	}

	/* Copy the "MOD_STAT_CFG" command into the "In" mailbox */
	size = sizeof (mcxnex_hw_mod_stat_cfg_t);
	for (i = 0; i < (size >> 3); i++) {
		data = ((uint64_t *)mod)[i];
		ddi_put64(mbox_info.mbi_in->mb_acchdl,
		    ((uint64_t *)mbox_info.mbi_in->mb_addr + i), data);
	}

	/* Sync the mailbox for the device to read */
	mcxnex_mbox_sync(mbox_info.mbi_in, 0, size, DDI_DMA_SYNC_FORDEV);

	/* Setup and post the "MOD_STAT_CFG" command */
	cmd.cp_inparm	= mbox_info.mbi_out->mb_mapaddr;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= 0;
	cmd.cp_opcode	= MOD_STAT_CFG;
	cmd.cp_opmod	= MCXNEX_MOD_STAT_CFG_PTR;
	cmd.cp_flags	= DDI_NOSLEEP;
	status = mcxnex_cmd_post(state, &cmd);

	/* Free "MOD_STAT_CFG" struct */
	kmem_free(mod, sizeof (mcxnex_hw_mod_stat_cfg_t));

	/* Free the mailbox */
	mcxnex_mbox_free(state, &mbox_info);
	return (status);
}
#endif

/*
 * mcxnex_stat_cfg_is_port_enabled()
 *
 *	check if port is enabled via MOD_STAT_CFG query
 *
 *	Return value:
 *		1: port is enabled
 *		0: port is disabled
 *		-1: error
 */
int
mcxnex_stat_cfg_is_port_enabled(mcxnex_state_t *state, int port)
{
	mcxnex_cmd_post_t	cmd;
	mcxnex_hw_msg_in_mod_t	inmod;
	int			status;

	bzero(&cmd, sizeof (cmd));
	bzero(&inmod, sizeof (inmod));

	/* Sync the mailbox for the device to read */
	inmod.data = 0;
	inmod.mod.setup_mode	= MCXNEX_MOD_STAT_CFG_SETUP_PORT;
	inmod.mod.port_num	= port;
	inmod.mod.offset	= MCXNEX_MOD_STAT_CFG_PORT_EN_OFFSET;

	/* Setup and post the "MOD_STAT_CFG" command */
	cmd.cp_outparm	= 0;
	cmd.cp_inparm	= 0;
	cmd.cp_inmod	= inmod.data;
	cmd.cp_opcode	= MOD_STAT_CFG;
	cmd.cp_opmod	= MCXNEX_MOD_STAT_CFG_QUERY_INLINE;
	cmd.cp_flags	= DDI_NOSLEEP;
	status = mcxnex_cmd_post(state, &cmd);
	if (status != MCXNEX_CMD_SUCCESS) {
		cmn_err(CE_NOTE, "mcxnex%d: %s cmd "
		    "failed (0x%x)", state->hs_instance,
		    "MOD_STAT_CFG", status);
		return (-1);
	}

	if (cmd.cp_outparm & MCXNEX_MOD_STAT_CFG_PORT_EN_MASK)
		return (1);

	return (0);
}

/*
 * mcxnex_map_cmd_post()
 *    Context: Can be called only from attach() path
 *
 * Generic routine to map FW, ICMA, and ICM.
 */
int
mcxnex_map_cmd_post(mcxnex_state_t *state, mcxnex_dma_info_t *dma,
    uint16_t opcode, ddi_dma_cookie_t cookie, uint_t ccount)
{
	mcxnex_mbox_info_t		mbox_info;
	mcxnex_cmd_post_t	cmd;
	mcxnex_hw_vpm_t		vpm;
	uint64_t		data;
	uint64_t		paddr, vaddr;
	uint_t			size;
	int			status, i, j, k = 0;
	int			max_mailbox_size;
	int			cookie_num_icm_pages;
	int			num_vpm_entries;
	int			log2_npages;
	int			npages;

	bzero(&cmd, sizeof (cmd));

	/* Allocate an IN mailbox */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_INMBOX;
	status = mcxnex_mbox_alloc(state, &mbox_info, DDI_SLEEP);
	if (status != MCXNEX_CMD_SUCCESS) {
		return (status);
	}

	/* Initialize cmd parameters */
	cmd.cp_outparm	= 0;
	cmd.cp_opcode	= opcode;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= DDI_NOSLEEP;

	/*
	 * Allocate a list of VPM (Virtual Physical Mapping) structures.
	 * A VPM encodes a power-of-2 number of DMA pages that have been
	 * allocated and are passed in the dma_info. We need to break up
	 * the DMA cookies that are in the dma_info into power-of-2 page
	 * mappings. We also need to keep track of the number of VPMs we
	 * have total, as it is used as the inmod for this command.
	 */

	/* Start with the ICM address passed and the first cookie */
	vaddr  = dma->icmaddr;

	/* Initialize the VPM count and the VPM struct */
	num_vpm_entries = 0;
	size = sizeof (mcxnex_hw_vpm_t);
	bzero(&vpm, size);

	/*
	 * Establish a max mailbox size (in VPM entries). If we reach this,
	 * we must post a MAP command, reinitialzie num_vpm_entries, and
	 * continue.
	 */
	max_mailbox_size = MCXNEX_MBOX_SIZE / size;

	/*
	 * First, walk through the DMA cookies and build VPMs from them.
	 */
	while (ccount-- > 0) {

		/* Determine the number of ICM pages in this cookie. */
		cookie_num_icm_pages = cookie.dmac_size / MCXNEX_PAGESIZE;

		/* Initialize this set of VPM's starting physical address. */
		paddr = cookie.dmac_laddress;

		/*
		 * Now build a set of VPMs for this cookie's memory, breaking
		 * up the cookies into multiple VPMs if necessary to achieve
		 * the required power-of-2 number of pages per VPM. Once each
		 * VPM is constructed, write it out to the mailbox memory.
		 */
		for (i = cookie_num_icm_pages; i > 0; i -= npages) {
			log2_npages = highbit(i) - 1;
			npages	    = (1 << log2_npages);
			/* Ensure this chunk is aligned on it's own size */
			while (((npages * MCXNEX_PAGESIZE - 1) & paddr) != 0) {
				log2_npages--;
				npages = (1 << log2_npages);
			}
			vpm.log2sz    = log2_npages;

			vpm.paddr_l = (uint32_t)(paddr >> 12);
			vpm.paddr_h = (uint32_t)(paddr >> 32);
			/* Increment the paddr for the next VPM */
			paddr += npages * MCXNEX_PAGESIZE;

			if (opcode == MAP_ICM) {
				vpm.vaddr_l = (uint32_t)(vaddr >> 12);
				vpm.vaddr_h = (uint32_t)(vaddr >> 32);
				/* Increment the ICM address for the next VPM */
				vaddr += npages * MCXNEX_PAGESIZE;
			}

