Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cmd.c
			/*
			 * Copy this VPM into the "In" mailbox. Note we're
			 * using 'k' as the offset from mb_addr for this cmd.
			 */
			for (j = 0; j < (size >> 3); j++, k++) {
				data = ((uint64_t *)(void *)&vpm)[j];
				ddi_put64(mbox_info.mbi_in->mb_acchdl,
				    ((uint64_t *)mbox_info.mbi_in->mb_addr + k),
				    data);
			}

			/*
			 * Increment the number of VPM entries and check
			 * against max mailbox size. If we have reached
			 * the maximum mailbox size, post the map cmd.
			 */
			if (++num_vpm_entries == max_mailbox_size) {

				/* Sync the mailbox for the device to read */
				mcxnex_mbox_sync(mbox_info.mbi_in, 0, (size *
				    num_vpm_entries), DDI_DMA_SYNC_FORDEV);

				/* Setup and post the command */
				cmd.cp_inparm	= mbox_info.mbi_in->mb_mapaddr;
				cmd.cp_inmod	= num_vpm_entries;
				status = mcxnex_cmd_post(state, &cmd);
				if (status != MCXNEX_CMD_SUCCESS) {
					cmn_err(CE_NOTE, "mcxnex%d: %s cmd "
					    "failed (0x%x)", state->hs_instance,
					    opcode == MAP_FA ? "MAP_FA" :
					    opcode == MAP_ICM ? "MAP_ICM" :
					    opcode == MAP_ICM_AUX ? "MAP_ICMA" :
					    "UNKNOWN", status);
					goto map_fail;
				}

				/*
				 * Reinitialize num_vpm_entries, and the
				 * mb_addr offset
				 */
				num_vpm_entries = k = 0;
			}
		}

		/* If count remains, move onto the next cookie */
		if (ccount != 0) {
			ddi_dma_nextcookie(dma->dma_hdl, &cookie);
		}
	}

	if (num_vpm_entries) {

		/* Sync the mailbox for the device to read */
		mcxnex_mbox_sync(mbox_info.mbi_in, 0, (size * num_vpm_entries),
		    DDI_DMA_SYNC_FORDEV);

		/* Setup and post the command */
		cmd.cp_inparm	= mbox_info.mbi_in->mb_mapaddr;
		cmd.cp_inmod	= num_vpm_entries;
		status = mcxnex_cmd_post(state, &cmd);
		if (status != MCXNEX_CMD_SUCCESS) {
			cmn_err(CE_NOTE, "mcxnex%d: %s cmd "
			    "failed (0x%x)", state->hs_instance,
			    opcode == MAP_FA ? "MAP_FA" :
			    opcode == MAP_ICM ? "MAP_ICM" :
			    opcode == MAP_ICM_AUX ? "MAP_ICMA" :
			    "UNKNOWN", status);
			goto map_fail;
		}
	}

map_fail:
	/* Free the mailbox */
	mcxnex_mbox_free(state, &mbox_info);
	return (status);
}


/*
 * mcxnex_unmap_fa_cmd_post()
 *    Context: Can be called only from attach() path
 */
int
mcxnex_unmap_fa_cmd_post(mcxnex_state_t *state)
{
	mcxnex_cmd_post_t	cmd;
	int			status;

	bzero(&cmd, sizeof (cmd));

	/* Setup and post the Mcxnex "UNMAP_FA" command */
	cmd.cp_inparm	= 0;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= 0;
	cmd.cp_opcode	= UNMAP_FA;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= DDI_NOSLEEP;
	status = mcxnex_cmd_post(state, &cmd);

	return (status);
}


/*
 * mcxnex_run_fw_cmd_post()
 *    Context: Can be called only from attach() path
 */
int
mcxnex_run_fw_cmd_post(mcxnex_state_t *state)
{
	mcxnex_cmd_post_t	cmd;
	int			status;

	bzero(&cmd, sizeof (cmd));

	/* Setup and post the "RUN_FW" command */
	cmd.cp_inparm	= 0;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= 0;
	cmd.cp_opcode	= RUN_FW;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= DDI_NOSLEEP;

	status = mcxnex_cmd_post(state, &cmd);
#ifdef FMA_TEST
	if (mcxnex_test_num == -2) {
		status = MCXNEX_CMD_BAD_NVMEM;
		/*
		 * No need of an ereport here since this case
		 * is treated as a degradation later.
		 */
		MCXNEX_FMANOTE(state, MCXNEX_FMA_BADNVMEM);
	}
#endif
	return (status);
}


/*
 * mcxnex_set_icm_size_cmd_post()
 *    Context: Can be called only from attach() path
 */
int
mcxnex_set_icm_size_cmd_post(mcxnex_state_t *state)
{
	mcxnex_cmd_post_t	cmd;
	int			status;

	bzero(&cmd, sizeof (cmd));

	/* Setup and post the "SET_ICM_SIZE" command */
	cmd.cp_inparm	= (uint64_t)state->hs_icm_sz;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= 0;
	cmd.cp_opcode	= SET_ICM_SIZE;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= DDI_NOSLEEP;
	status = mcxnex_cmd_post(state, &cmd);

	/*
	 * Aux ICM size in 4K pages returned in output param
	 * convert it to bytes
	 */
	state->hs_icma_sz = (uint64_t)(cmd.cp_outparm << MCXNEX_PAGESHIFT);
	return (status);
}


/*
 * mcxnex_unmap_icm_aux_cmd_post()
 *    Context: Can be called only from attach() path
 */
int
mcxnex_unmap_icm_aux_cmd_post(mcxnex_state_t *state)
{
	mcxnex_cmd_post_t	cmd;
	int			status;

	bzero(&cmd, sizeof (cmd));

	/* Setup and post the "UNMAP_ICM_AUX" command */
	cmd.cp_inparm	= 0;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= 0;
	cmd.cp_opcode	= UNMAP_ICM_AUX;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= DDI_NOSLEEP;
	status = mcxnex_cmd_post(state, &cmd);
	return (status);
}


/*
 * mcxnex_unmap_icm_cmd_post()
 *    Context: Can be called from base or attach context
 */
int
mcxnex_unmap_icm_cmd_post(mcxnex_state_t *state, mcxnex_dma_info_t *dma_info)
{
	mcxnex_cmd_post_t	cmd;
	uint64_t		addr;
	uint32_t		npages;
	int			status;

	/*
	 * Setup and post the Mcxnex "UNMAP_ICM" command. If a
	 * mcxnex_dma_info_t was passed, we want to unmap a set
	 * of pages. Otherwise, unmap all of ICM.
	 */
	if (dma_info != NULL) {
		addr   = dma_info->icmaddr;
		npages = dma_info->length / MCXNEX_PAGESIZE;
	} else {
		addr   = 0;
		npages = state->hs_icm_sz / MCXNEX_PAGESIZE;
	}

	/* Setup and post the "UNMAP_ICM" command */
	bzero(&cmd, sizeof (cmd));
	cmd.cp_inparm	= addr;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= npages;
	cmd.cp_opcode	= UNMAP_ICM;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= DDI_NOSLEEP;
	status = mcxnex_cmd_post(state, &cmd);
	return (status);
}


/*
 * mcxnex_mad_ifc_cmd_post()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_mad_ifc_cmd_post(mcxnex_state_t *state, uint_t port,
    uint_t sleepflag, uint32_t *mad, uint32_t *resp)
{
	mcxnex_mbox_info_t		mbox_info;
	mcxnex_cmd_post_t	cmd;
	uint_t			size;
	int			status;

	bzero(&cmd, sizeof (cmd));

	/* Get "In" and "Out" mailboxes for the command */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_INMBOX | MCXNEX_ALLOC_OUTMBOX;
	status = mcxnex_mbox_alloc(state, &mbox_info, sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		return (status);
	}

	/* Copy the request MAD into the "In" mailbox */
	size = MCXNEX_CMD_MAD_IFC_SIZE;
	bcopy(mad, mbox_info.mbi_in->mb_addr, size);

	/* Sync the mailbox for the device to read */
	mcxnex_mbox_sync(mbox_info.mbi_in, 0, size, DDI_DMA_SYNC_FORDEV);

	/* Setup the Mcxnex "MAD_IFC" command */
	cmd.cp_inparm	= mbox_info.mbi_in->mb_mapaddr;
	cmd.cp_outparm	= mbox_info.mbi_out->mb_mapaddr;
	cmd.cp_inmod	= port;
	cmd.cp_opcode	= MAD_IFC;
	cmd.cp_opmod	= MCXNEX_CMD_MKEY_CHECK;  /* Enable MKey checking */
	cmd.cp_flags	= sleepflag;
	status = mcxnex_cmd_post(state, &cmd);
	if (status != MCXNEX_CMD_SUCCESS) {
		goto mad_ifc_fail;
	}

	/* Sync the mailbox to read the results */
	mcxnex_mbox_sync(mbox_info.mbi_out, 0, size, DDI_DMA_SYNC_FORCPU);

	/* Copy the response MAD into "resp" */
	bcopy(mbox_info.mbi_out->mb_addr, resp, size);

mad_ifc_fail:
	/* Free the mailbox */
	mcxnex_mbox_free(state, &mbox_info);
	return (status);
}


