Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cmd.c
/*
 * mcxnex_getportinfo_cmd_post()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_getportinfo_cmd_post(mcxnex_state_t *state, uint_t port,
    uint_t sleepflag, sm_portinfo_t *portinfo)
{
	mcxnex_mbox_info_t		mbox_info;
	mcxnex_cmd_post_t	cmd;
	uint32_t		*mbox;
	uint_t			size;
	int			status, i;

	bzero(&cmd, sizeof (cmd));

	/* Get "In" and "Out" mailboxes for the command */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_INMBOX | MCXNEX_ALLOC_OUTMBOX;
	status = mcxnex_mbox_alloc(state, &mbox_info, sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		return (status);
	}

	/* Build the GetPortInfo request MAD in the "In" mailbox */
	size = MCXNEX_CMD_MAD_IFC_SIZE;
	mbox = (uint32_t *)mbox_info.mbi_in->mb_addr;
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[0], MCXNEX_CMD_MADHDR0);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[1], MCXNEX_CMD_MADHDR1);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[2], MCXNEX_CMD_MADHDR2);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[3], MCXNEX_CMD_MADHDR3);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[4], MCXNEX_CMD_PORTINFO);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[5], port);
	for (i = 6; i < (size >> 2); i++) {
		ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[i], 0);
	}

	/* Sync the mailbox for the device to read */
	mcxnex_mbox_sync(mbox_info.mbi_in, 0, size, DDI_DMA_SYNC_FORDEV);

	/* Setup the Mcxnex "MAD_IFC" command */
	cmd.cp_inparm	= mbox_info.mbi_in->mb_mapaddr;
	cmd.cp_outparm	= mbox_info.mbi_out->mb_mapaddr;
	cmd.cp_inmod	= port;
	cmd.cp_opcode	= MAD_IFC;
	cmd.cp_opmod	= MCXNEX_CMD_MKEY_DONTCHECK;  /* No MKey checking */
	cmd.cp_flags	= DDI_NOSLEEP; /* NO SLEEP */
	status = mcxnex_cmd_post(state, &cmd);
	if (status != MCXNEX_CMD_SUCCESS) {
		goto getportinfo_fail;
	}

	/* Sync the mailbox to read the results */
	size = sizeof (sm_portinfo_t);
	mcxnex_mbox_sync(mbox_info.mbi_out, MCXNEX_CMD_MADDATA_OFFSET,
	    size, DDI_DMA_SYNC_FORCPU);

	/*
	 * Copy GetPortInfo response MAD into "portinfo".  Do any endian
	 * swapping that may be necessary to flip any of the "portinfo"
	 * fields
	 */
	bcopy((void *)((uintptr_t)mbox_info.mbi_out->mb_addr +
	    MCXNEX_CMD_MADDATA_OFFSET), portinfo, size);
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*portinfo))
	MCXNEX_GETPORTINFO_SWAP(portinfo);

getportinfo_fail:
	/* Free the mailbox */
	mcxnex_mbox_free(state, &mbox_info);
	return (status);
}

/*
 * mcxnex_is_ext_port_counters_supported()
 *
 * Determine weather extended port counters are supported or not by sending
 * ClassPortInfo perf mgmt class MAD.
 */
int
mcxnex_is_ext_port_counters_supported(mcxnex_state_t *state, uint_t port,
    uint_t sleepflag, int *ext_width_supported)
{
	mcxnex_mbox_info_t		mbox_info;
	mcxnex_cmd_post_t	cmd;
	uint64_t		data;
	uint32_t		*mbox;
	int			status;

	bzero(&cmd, sizeof (cmd));

	/* Get "In" and "Out" mailboxes for the command */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_INMBOX | MCXNEX_ALLOC_OUTMBOX;
	status = mcxnex_mbox_alloc(state, &mbox_info, sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		return (status);
	}

	/* Build the ClassPortInfo request MAD in the "In" mailbox */
	mbox = (uint32_t *)mbox_info.mbi_in->mb_addr;

	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[0], MCXNEX_CMD_PERF_GET);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[1], MCXNEX_CMD_MADHDR1);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[2], MCXNEX_CMD_MADHDR2);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[3], MCXNEX_CMD_MADHDR3);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[4],
	    MCXNEX_CMD_CLASSPORTINFO);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[5], MCXNEX_CMD_PERFATTR);

	/* Sync the mailbox for the device to read */
	mcxnex_mbox_sync(mbox_info.mbi_in, 0, MCXNEX_CMD_MAD_IFC_SIZE,
	    DDI_DMA_SYNC_FORDEV);

	/* Setup the Mcxnex "MAD_IFC" command */
	cmd.cp_inparm	= mbox_info.mbi_in->mb_mapaddr;
	cmd.cp_outparm	= mbox_info.mbi_out->mb_mapaddr;
	cmd.cp_inmod	= port;
	cmd.cp_opcode	= MAD_IFC;
	/* No MKey and BKey checking */
	cmd.cp_opmod	= MCXNEX_CMD_MKEY_DONTCHECK | MCXNEX_CMD_BKEY_DONTCHECK;
	cmd.cp_flags	= DDI_NOSLEEP; /* NO SLEEP */
	status = mcxnex_cmd_post(state, &cmd);
	if (status != MCXNEX_CMD_SUCCESS) {
		goto fail;
	}

	/* Sync the mailbox to read the results */
	mcxnex_mbox_sync(mbox_info.mbi_out, 0, MCXNEX_CMD_MAD_IFC_SIZE,
	    DDI_DMA_SYNC_FORCPU);

	/*
	 * We can discard the MAD header and the reserved area of the
	 * perf mgmt class MAD
	 */
	data = ddi_get64(mbox_info.mbi_out->mb_acchdl,
	    ((uint64_t *)mbox_info.mbi_out->mb_addr + 8));
	*ext_width_supported = (data & (MCXNEX_IS_EXT_WIDTH_SUPPORTED |
	    MCXNEX_IS_EXT_WIDTH_SUPPORTED_NOIETF)) ? 1 : 0;

fail:
	/* Free the mailbox */
	mcxnex_mbox_free(state, &mbox_info);
	return (status);
}

/*
 * mcxnex_getextpefcntr_cmd_post()
 *
 * Read the extended performance counters of the specified port and
 * copy them into perfinfo.
 */
int
mcxnex_getextperfcntr_cmd_post(mcxnex_state_t *state, uint_t port,
    uint_t sleepflag, mcxnex_hw_sm_extperfcntr_t *perfinfo)
{
	mcxnex_mbox_info_t		mbox_info;
	mcxnex_cmd_post_t	cmd;
	uint64_t		data;
	uint32_t		*mbox;
	int			status, i;

	bzero(&cmd, sizeof (cmd));

	/* Get "In" and "Out" mailboxes for the command */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_INMBOX | MCXNEX_ALLOC_OUTMBOX;
	status = mcxnex_mbox_alloc(state, &mbox_info, sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		return (status);
	}

	/* Build PortCountersExtended request MAD in the "In" mailbox */
	mbox = (uint32_t *)mbox_info.mbi_in->mb_addr;

	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[0], MCXNEX_CMD_PERF_GET);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[1], MCXNEX_CMD_MADHDR1);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[2], MCXNEX_CMD_MADHDR2);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[3], MCXNEX_CMD_MADHDR3);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[4],
	    MCXNEX_CMD_EXTPERFCNTRS);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[5], MCXNEX_CMD_PERFATTR);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[16], (port << 16));

	/* Sync the mailbox for the device to read */
	mcxnex_mbox_sync(mbox_info.mbi_in, 0, MCXNEX_CMD_MAD_IFC_SIZE,
	    DDI_DMA_SYNC_FORDEV);

	/* Setup the Mcxnex "MAD_IFC" command */
	cmd.cp_inparm	= mbox_info.mbi_in->mb_mapaddr;
	cmd.cp_outparm	= mbox_info.mbi_out->mb_mapaddr;
	cmd.cp_inmod	= port;
	cmd.cp_opcode	= MAD_IFC;
	/* No MKey and BKey checking */
	cmd.cp_opmod	= MCXNEX_CMD_MKEY_DONTCHECK | MCXNEX_CMD_BKEY_DONTCHECK;
	cmd.cp_flags	= DDI_NOSLEEP; /* NO SLEEP */
	status = mcxnex_cmd_post(state, &cmd);
	if (status != MCXNEX_CMD_SUCCESS) {
		goto fail;
	}

	/* Sync the mailbox to read the results */
	mcxnex_mbox_sync(mbox_info.mbi_out, 0, MCXNEX_CMD_MAD_IFC_SIZE,
	    DDI_DMA_SYNC_FORCPU);

