Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cmd.c
	/*
	 * Copy Perfcounters into "perfinfo". We can discard the MAD
	 * header and the reserved area of the perf mgmt class MAD.
	 */
	for (i = 0; i < (sizeof (mcxnex_hw_sm_extperfcntr_t) >> 3); i++) {
		data = ddi_get64(mbox_info.mbi_out->mb_acchdl,
		    ((uint64_t *)mbox_info.mbi_out->mb_addr + i + 8));
		((uint64_t *)(void *)perfinfo)[i] = data;
	}

fail:
	/* Free the mailbox */
	mcxnex_mbox_free(state, &mbox_info);
	return (status);
}

/*
 * mcxnex_getpefcntr_cmd_post()
 *    Context: Can be called from interrupt or base context.
 *
 * If reset is zero, read the performance counters of the specified port and
 * copy them into perfinfo.
 * If reset is non-zero reset the performance counters of the specified port.
 */
int
mcxnex_getperfcntr_cmd_post(mcxnex_state_t *state, uint_t port,
    uint_t sleepflag, mcxnex_hw_sm_perfcntr_t *perfinfo, int reset)
{
	mcxnex_mbox_info_t		mbox_info;
	mcxnex_cmd_post_t	cmd;
	uint64_t		data;
	uint32_t		*mbox;
	uint_t			size;
	int			status, i;

	bzero(&cmd, sizeof (cmd));

	/* Get "In" and "Out" mailboxes for the command */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_INMBOX | MCXNEX_ALLOC_OUTMBOX;
	status = mcxnex_mbox_alloc(state, &mbox_info, sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		return (status);
	}

	/* Build the GetPortInfo request MAD in the "In" mailbox */
	size = MCXNEX_CMD_MAD_IFC_SIZE;
	mbox = (uint32_t *)mbox_info.mbi_in->mb_addr;

	if (reset) {
		ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[0],
		    MCXNEX_CMD_PERF_SET);
	} else {
		ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[0],
		    MCXNEX_CMD_PERF_GET);
	}
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[1], MCXNEX_CMD_MADHDR1);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[2], MCXNEX_CMD_MADHDR2);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[3], MCXNEX_CMD_MADHDR3);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[4], MCXNEX_CMD_PERFCNTRS);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[5], MCXNEX_CMD_PERFATTR);

	if (reset) {
		/* reset counters for XmitData, RcvData, XmitPkts, RcvPkts */
		ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[16],
		    ((port << 16) | 0xf000));

		ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[22], 0);
		ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[23], 0);
		ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[24], 0);
		ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[25], 0);
	} else
		ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[16], (port << 16));

	/* Sync the mailbox for the device to read */
	mcxnex_mbox_sync(mbox_info.mbi_in, 0, size, DDI_DMA_SYNC_FORDEV);

	/* Setup the Mcxnex "MAD_IFC" command */
	cmd.cp_inparm	= mbox_info.mbi_in->mb_mapaddr;
	cmd.cp_outparm	= mbox_info.mbi_out->mb_mapaddr;
	cmd.cp_inmod	= port;
	cmd.cp_opcode	= MAD_IFC;
	/* No MKey and BKey checking */
	cmd.cp_opmod	= MCXNEX_CMD_MKEY_DONTCHECK | MCXNEX_CMD_BKEY_DONTCHECK;
	cmd.cp_flags	= DDI_NOSLEEP; /* NO SLEEP */
	status = mcxnex_cmd_post(state, &cmd);
	if (status != MCXNEX_CMD_SUCCESS) {
		goto getperfinfo_fail;
	}

	/* Sync the mailbox to read the results */
	size = MCXNEX_CMD_MAD_IFC_SIZE;
	mcxnex_mbox_sync(mbox_info.mbi_out, 0, size, DDI_DMA_SYNC_FORCPU);

	if (reset == 0) {
		size = sizeof (mcxnex_hw_sm_perfcntr_t); /* for the copy */
		/*
		 * Copy Perfcounters into "perfinfo".  We can discard the MAD
		 * header and the 8 Quadword reserved area of the PERM mgmt
		 * class MAD
		 */

		for (i = 0; i < size >> 3; i++) {
			data = ddi_get64(mbox_info.mbi_out->mb_acchdl,
			    ((uint64_t *)mbox_info.mbi_out->mb_addr + i + 8));
			((uint64_t *)(void *)perfinfo)[i] = data;
		}
	}

getperfinfo_fail:
	/* Free the mailbox */
	mcxnex_mbox_free(state, &mbox_info);
	return (status);
}



/*
 * mcxnex_getnodeinfo_cmd_post()
 *    Context: Can be called from interrupt or base context.
 *    (Currently called only from attach() and detach() path contexts)
 */
int
mcxnex_getnodeinfo_cmd_post(mcxnex_state_t *state, uint_t sleepflag,
    sm_nodeinfo_t *nodeinfo)
{
	mcxnex_mbox_info_t		mbox_info;
	mcxnex_cmd_post_t	cmd;
	uint32_t		*mbox;
	uint_t			size;
	int			status, i;

	/* Make sure we are called with the correct flag */
	ASSERT(sleepflag == DDI_NOSLEEP);

	bzero(&cmd, sizeof (cmd));

	/* Get "In" and "Out" mailboxes for the command */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_INMBOX | MCXNEX_ALLOC_OUTMBOX;
	status = mcxnex_mbox_alloc(state, &mbox_info, sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		return (status);
	}

	/* Build the GetNodeInfo request MAD into the "In" mailbox */
	size = MCXNEX_CMD_MAD_IFC_SIZE;
	mbox = (uint32_t *)mbox_info.mbi_in->mb_addr;
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[0], MCXNEX_CMD_MADHDR0);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[1], MCXNEX_CMD_MADHDR1);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[2], MCXNEX_CMD_MADHDR2);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[3], MCXNEX_CMD_MADHDR3);
	ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[4], MCXNEX_CMD_NODEINFO);
	for (i = 5; i < (size >> 2); i++) {
		ddi_put32(mbox_info.mbi_in->mb_acchdl, &mbox[i], 0);
	}

	/* Sync the mailbox for the device to read */
	mcxnex_mbox_sync(mbox_info.mbi_in, 0, size, DDI_DMA_SYNC_FORDEV);

	/* Setup the Mcxnex "MAD_IFC" command */
	cmd.cp_inparm	= mbox_info.mbi_in->mb_mapaddr;
	cmd.cp_outparm	= mbox_info.mbi_out->mb_mapaddr;
	cmd.cp_inmod	= 1;  /* Get NodeInfo from port #1 */
	cmd.cp_opcode	= MAD_IFC;
	cmd.cp_opmod	= MCXNEX_CMD_MKEY_DONTCHECK;  /* No MKey checking */
	cmd.cp_flags	= sleepflag;
	status = mcxnex_cmd_post(state, &cmd);
	if (status != MCXNEX_CMD_SUCCESS) {
		goto getnodeinfo_fail;
	}

	/* Sync the mailbox to read the results */
	size = sizeof (sm_nodeinfo_t);
	mcxnex_mbox_sync(mbox_info.mbi_out, MCXNEX_CMD_MADDATA_OFFSET,
	    size, DDI_DMA_SYNC_FORCPU);

	/*
	 * Copy GetNodeInfo response MAD into "nodeinfo".  Do any endian
	 * swapping that may be necessary to flip any of the "nodeinfo"
	 * fields
	 */
	bcopy((void *)((uintptr_t)mbox_info.mbi_out->mb_addr +
	    MCXNEX_CMD_MADDATA_OFFSET), nodeinfo, size);
	_NOTE(NOW_INVISIBLE_TO_OTHER_THREADS(*nodeinfo))
	MCXNEX_GETNODEINFO_SWAP(nodeinfo);

getnodeinfo_fail:
	/* Free the mailbox */
	mcxnex_mbox_free(state, &mbox_info);
	return (status);
}


