Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_cmd.c
	/* Setup and post the "MGID_HASH" command */
	cmd.cp_inparm	= mbox_info.mbi_in->mb_mapaddr;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= 0;
	cmd.cp_opcode	= MGID_HASH;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= sleepflag;
	status = mcxnex_cmd_post(state, &cmd);

	/* MGID hash value is returned in command "outparam" */
	*mgid_hash = cmd.cp_outparm;

	/* Free the mailbox */
	mcxnex_mbox_free(state, &mbox_info);
	return (status);
}


/*
 * mcxnex_read_mgm_cmd_post()
 *    Context: Can be called from interrupt or base context.
 *
 * Note: It is assumed that the "mcg" parameter is actually a pointer to a
 *    "mcxnex_hw_mcg_t" struct and some number of "mcxnex_hw_mcg_qp_list_t"
 *    structs.  Combined size should be equal to result of MCXNEX_MCGMEM_SZ()
 *    macro.
 */
int
mcxnex_read_mgm_cmd_post(mcxnex_state_t *state, mcxnex_hw_mcg_t *mcg,
    uint_t mcgindx, uint_t sleepflag)
{
	mcxnex_mbox_info_t	mbox_info;
	mcxnex_cmd_post_t	cmd;
	uint64_t		data;
	uint32_t		data32;
	uint_t			size, hdrsz, qplistsz;
	int			status, i;

	bzero(&cmd, sizeof (cmd));

	/* Get an "Out" mailbox for the results */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_OUTMBOX;
	status = mcxnex_mbox_alloc(state, &mbox_info, sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		return (status);
	}

	/* Setup and post "READ_MGM" command */
	cmd.cp_inparm	= 0;
	cmd.cp_outparm	= mbox_info.mbi_out->mb_mapaddr;
	cmd.cp_inmod	= mcgindx;
	cmd.cp_opcode	= READ_MGM;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= sleepflag;
	status = mcxnex_cmd_post(state, &cmd);
	if (status != MCXNEX_CMD_SUCCESS) {
		goto read_mgm_fail;
	}

	/* Sync the mailbox to read the results */
	size = MCXNEX_MCGMEM_SZ(state);
	mcxnex_mbox_sync(mbox_info.mbi_out, 0, size, DDI_DMA_SYNC_FORCPU);

	/* Copy the READ_MGM command results into "mcg" */
	hdrsz = sizeof (mcxnex_hw_mcg_t);
	for (i = 0; i < (hdrsz >> 3); i++) {
		data = ddi_get64(mbox_info.mbi_out->mb_acchdl,
		    ((uint64_t *)mbox_info.mbi_out->mb_addr + i));
		((uint64_t *)mcg)[i] = data;
	}
	qplistsz = size - hdrsz;
	for (i = 0; i < (qplistsz >> 2); i++) {
		data32 = ddi_get32(mbox_info.mbi_out->mb_acchdl,
		    ((uint32_t *)mbox_info.mbi_out->mb_addr + i + 8));
		((uint32_t *)mcg)[i + 8] = data32;
	}

read_mgm_fail:
	/* Free the mailbox */
	mcxnex_mbox_free(state, &mbox_info);
	return (status);
}


/*
 * mcxnex_write_mgm_cmd_post()
 *    Context: Can be called from interrupt or base context.
 *
 * Note: It is assumed that the "mcg" parameter is actually a pointer to a
 *    "mcxnex_hw_mcg_t" struct and some number of "mcxnex_hw_mcg_qp_list_t"
 *    structs.  Combined size should be equal to result of MCXNEX_MCGMEM_SZ()
 *    macro.
 */
int
mcxnex_write_mgm_cmd_post(mcxnex_state_t *state, mcxnex_hw_mcg_t *mcg,
    uint_t mcgindx, uint_t sleepflag)
{
	mcxnex_mbox_info_t	mbox_info;
	mcxnex_cmd_post_t	cmd;
	uint64_t		data;
	uint_t			size, hdrsz, qplistsz;
	int			status, i;

	bzero(&cmd, sizeof (cmd));

	/* Get an "In" mailbox for the command */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_INMBOX;
	status = mcxnex_mbox_alloc(state, &mbox_info, sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		return (status);
	}

	/* Copy the "WRITE_MGM" command into mailbox */
	size  = MCXNEX_MCGMEM_SZ(state);
	hdrsz = sizeof (mcxnex_hw_mcg_t);
	for (i = 0; i < (hdrsz >> 3); i++) {
		data = ((uint64_t *)mcg)[i];
		ddi_put64(mbox_info.mbi_in->mb_acchdl,
		    ((uint64_t *)mbox_info.mbi_in->mb_addr + i), data);
	}
	qplistsz = size - hdrsz;
	for (i = 0; i < (qplistsz >> 2); i++) {
		data = ((uint32_t *)mcg)[i + 8];
		ddi_put32(mbox_info.mbi_in->mb_acchdl,
		    ((uint32_t *)mbox_info.mbi_in->mb_addr + i + 8), data);
	}

	/* Sync the mailbox for the device to read */
	mcxnex_mbox_sync(mbox_info.mbi_in, 0, size, DDI_DMA_SYNC_FORDEV);

	/* Setup and post Mcxnex "WRITE_MGM" command */
	cmd.cp_inparm	= mbox_info.mbi_in->mb_mapaddr;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= mcgindx;
	cmd.cp_opcode	= WRITE_MGM;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= sleepflag;
	status = mcxnex_cmd_post(state, &cmd);

	/* Free the mailbox */
	mcxnex_mbox_free(state, &mbox_info);
	return (status);
}

/*
 * mcxnex_resize_srq_cmd_post()
 *    Context: Can be called from interrupt or base context.
 */

int mcxnex_resize_srq_cmd_post(mcxnex_state_t *state, mcxnex_hw_srqc_t *srq,
    uint_t srqnum, uint_t sleepflag)
{
	mcxnex_mbox_info_t		mbox_info;
	mcxnex_cmd_post_t	cmd;
	uint64_t		data;
	uint_t			size;
	int			status, i;

	bzero(&cmd, sizeof (cmd));

	/* Get an "In" mailbox for the command */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_INMBOX;
	status = mcxnex_mbox_alloc(state, &mbox_info, sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		return (status);
	}

	/* Copy the Mcxnex "RESIZE_SRQ" command into mailbox */
	size = sizeof (mcxnex_hw_srqc_t);
	for (i = 0; i < (size >> 3); i++) {
		data = ((uint64_t *)(void *)srq)[i];
		ddi_put64(mbox_info.mbi_in->mb_acchdl,
		    ((uint64_t *)mbox_info.mbi_in->mb_addr + i), data);
	}

	/* Sync the mailbox for the device to read */
	mcxnex_mbox_sync(mbox_info.mbi_in, 0, size, DDI_DMA_SYNC_FORDEV);

	/* Setup and post Mcxnex "RESIZE_SRQ" command */
	cmd.cp_inparm	= mbox_info.mbi_in->mb_mapaddr;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= srqnum;
	cmd.cp_opcode	= RESIZE_SRQ;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= sleepflag;
	status = mcxnex_cmd_post(state, &cmd);

	/* Free the mailbox */
	mcxnex_mbox_free(state, &mbox_info);
	return (status);
}
/*
 * mcxnex_modify_mpt_cmd_post()
 *    Context: Can be called from interrupt or base context.
 */
int
mcxnex_modify_mpt_cmd_post(mcxnex_state_t *state, mcxnex_hw_dmpt_t *mpt,
    uint_t mptindx, uint_t flags, uint_t sleepflag)
{
	mcxnex_mbox_info_t		mbox_info;
	mcxnex_cmd_post_t	cmd;
	uint64_t		data;
	uint_t			size;
	int			status, i;

	bzero(&cmd, sizeof (cmd));

	/* Get an "In" mailbox for the command */
	mbox_info.mbi_alloc_flags = MCXNEX_ALLOC_INMBOX;
	status = mcxnex_mbox_alloc(state, &mbox_info, sleepflag);
	if (status != MCXNEX_CMD_SUCCESS) {
		return (status);
	}

	/* Copy the Mcxnex "MODIFY_MPT" command into mailbox */
	size = sizeof (mcxnex_hw_dmpt_t);
	for (i = 0; i < (size >> 3); i++) {
		data = ((uint64_t *)mpt)[i];
		ddi_put64(mbox_info.mbi_in->mb_acchdl,
		    ((uint64_t *)mbox_info.mbi_in->mb_addr + i), data);
	}

	/* Sync the mailbox for the device to read */
	mcxnex_mbox_sync(mbox_info.mbi_in, 0, size, DDI_DMA_SYNC_FORDEV);

	/* Setup and post Mcxnex "MODIFY_MPT" command */
	cmd.cp_inparm	= mbox_info.mbi_in->mb_mapaddr;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= mptindx;
	cmd.cp_opcode	= MODIFY_MPT;
	cmd.cp_opmod	= (uint16_t)flags;
	cmd.cp_flags	= sleepflag;
	status = mcxnex_cmd_post(state, &cmd);

	/* Free the mailbox */
	mcxnex_mbox_free(state, &mbox_info);
	return (status);
}


int
mcxnex_nop_post(mcxnex_state_t *state, uint_t interval, uint_t sleep)
{
	mcxnex_cmd_post_t	cmd;
	int			status;

	bzero(&cmd, sizeof (cmd));

	/* Setup and post Mcxnex "CMD_NOP" command */
	cmd.cp_inparm	= 0;
	cmd.cp_outparm	= 0;
	cmd.cp_inmod	= interval;
	cmd.cp_opcode	= CMD_NOP;
	cmd.cp_opmod	= 0;
	cmd.cp_flags	= DDI_SLEEP;
	if (sleep) cmd.cp_flags	= DDI_NOSLEEP;
	status = mcxnex_cmd_post(state, &cmd);
	return (status);
}
